<%-- 
    Document   : printkredit
    Created on : 27.04.2017, 21:09:40
    Author     : Elena
--%>

<%@page import="java.util.ListIterator"%>
<%@page import="java.util.ArrayList"%>
<%@page contentType="text/html" pageEncoding="UTF-8"%>
<%@taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>

<!DOCTYPE html>
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>Интернет-магазин косметики Sharmi</title>
    </head>
    <body>
        <h1></h1>
        <!--% ArrayList<String> states = (ArrayList)request.getAttribute("kredit");
         
        ListIterator<String> listIter = states.listIterator();
         
        while(listIter.hasNext()){ %>
        <!--c:out value="${user}" /-->
           <!--%= listIter.next() %-->
      <!--%  } %/-->

      <p>
          Общие положения Договора <br>											УТВЕРЖДЕНО
Протокол заседания Правления ОАО «СуперБанк»<br>
25.10.2016г. № 100
<br><br>
Кредитополучатель – физическое лицо, заключившее с Банком кредитный договор.<br>
Стороны – Банк, Кредитополучатель.<br>
Договор – кредитный договор, заключается между Банком и Кредитополучателем, в соответствии с которым Банк предоставляет Кредитополучателю потребительский кредит. <br>
<br>Договор содержит идентификационные данные Кредитополучателя и индивидуальные условия предоставления кредита. К Договору прилагаются Общие положения Договора, являющиеся неотъемлемой частью Договора.
<br>Поставщик – юридическое лицо (в т.ч. банк, страховая организация) или индивидуальный предприниматель, заключившее договор
поставки/оказания услуг/выполнения работ (в т.ч. кредитный договор) с Кредитополучателем, оплата по которому будет осуществлена полностью
либо частично за счет кредита, выданного Банком.
<br><br>
1. ПРЕДМЕТ ДОГОВОРА<br>
1.1. Банк обязуется предоставить денежные средства (кредит) Кредитополучателю в размере и на условиях, предусмотренных Договором, а Кредитополучатель обязуется возвратить полученный кредит, уплатить проценты за
пользование оплачивать услуги Банка, выполнять другие условия, оговоренные Договором.<br>
1.2. Под задолженностью по кредиту в Договоре понимается сумма основного долга и начисленных процентов.<br>
<br><br>
2. УСЛОВИЯ КРЕДИТОВАНИЯ
<br>2.1. Банк предоставляет Кредитополучателю кредит на потребительские нужды в размере суммы заказа в интернет-магазине Sharmi.
<br>2.2. Кредитополучатель обязуется ежемесячно производить погашение задолженности по Договору в размере, указанном в поле 9 (основной долг,
проценты и плата).
<br>2.3. Процентная ставка за пользование кредитом на момент подписания Договора установлена в размере 10% годовых.
<br>2.4. Целевое назначение кредита – потребительские нужды. Банк не осуществляет контроль за целевым использованием кредита.
<br><br>
<br>3. ПОРЯДОК ВЫДАЧИ КРЕДИТА
<br>3.1. Банк производит выдачу кредита наличными денежными средствами в кассе Банка (при условии личного обращения Кредитополучателя в кассу,
указанную Банком), либо в безналичном порядке путем перечисления Банком денежных средств на счет Кредитополучателя или путем использования
денежных средств в соответствии с указаниями Кредитополучателя (в т.ч. перечисления их для выдачи Кредитополучателю в отделении почтовой
связи РУП «Белпочта» по адресу фактического проживания Кредитополучателя) с оформлением платежных документов (ордеров) по реквизитам,
указанным в поле 10 Договора.<br><br>

4. ОБЯЗАННОСТИ СТОРОН<br>
4.1. Банк обязан:<br>
В течение 5 (Пяти) банковских дней со дня подписания сторонами Договора выдать кредит.<br>
4.2.Кредитополучатель обязан:<br>
4.2.1. Производить погашение задолженности по Договору путём:<br>
4.2.1.1. внесения наличных денег в кассы Банка, а также через отделения РУП «Белпочта»;<br>
4.2.1.2. в безналичном порядке путем перечисления со своего текущего (расчетного) счета, открытого в Банке (при этом Кредитополучатель
осведомлен, что денежные средства зачисляются на соответствующие счета в Банке не ранее следующего рабочего дня, если платеж проведен в
выходной (праздничный) день или после 17.00 в рабочий день).<br>
Погашение задолженности по кредиту иным способом, за исключением погашения с помощью расчетных платежных терминалов
(Cash In) Банка, не допускается.<br>
4.2.2. Своевременно исполнять обязательства по Договору, в том числе и в случае неисполнения обязательств Поставщиком. <br><br>

5. ПРАВА СТОРОН<br>
5.1. Банк имеет право:<br>
5.1.1. В одностороннем порядке предъявить кредит к досрочному истребованию и взыскать сумму задолженности по Договору в следующих случаях:<br>
5.1.1.1. нарушения Кредитополучателем более чем на 30 (Тридцать) календарных дней сроков уплаты причитающихся Банку сумм по Договору;<br>
5.1.2. Без предварительного уведомления Кредитополучателя, в случае переплаты последним платежей по кредиту при окончательном расчете по
Договору, зачислить излишне уплаченные Кредитополучателем суммы на текущий (расчетный) счет Кредитополучателя в Банке или произвести
возврат излишне уплаченных Кредитополучателем сумм в срок до 30 (Тридцати) рабочих дней со дня образования переплаты через отделение РУП
«Белпочта» по месту регистрации Кредитополучателя. Расходы по переводу денежных средств, причитающиеся банку-отправителю, возмещаются за
счет Кредитополучателя.<br>

5.2. Кредитополучатель имеет право:<br>
5.2.1. Досрочно погасить кредит, при этом Кредитополучатель обязан уплатить Банку проценты за время фактического пользования кредитом, а также
плату за все прошедшие с момента выдачи кредита даты, установленные в Графике погашения, и в день досрочного погашения кредита.<br>
5.2.2. Возложить исполнение своих обязательств по Договору на третье лицо. В случае исполнения обязательств третьим лицом, обязательства
Кредитополучателя считаются надлежащим образом исполненными с момента исполнения.
<br><br>
6. ОТВЕТСТВЕННОСТЬ СТОРОН<br>
6.1. За неисполнение своих обязательств по Договору Банк несет ответственность в соответствии с законодательством Республики Беларусь. Банк не
несет ответственности за возникновение конфликтных ситуаций вне сферы его контроля.<br>
6.2. Кредитополучатель возмещает Банку убытки вследствие неисполнения (ненадлежащего исполнения) обязательств по Договору, включая судебные
издержки и другое.<br>
6.3. За изменение условий Договора по инициативе Кредитополучателя, последний уплачивает Банку вознаграждение согласно перечню
вознаграждений за услуги, оказываемые физическим лицам, действующему на момент оказания услуги.
<br><br>
7. СРОК ДЕЙСТВИЯ ДОГОВОРА И ПОРЯДОК ЕГО ИЗМЕНЕНИЯ
<br>
7.1. Договор вступает в силу с момента его подписания сторонами. Действие Договора прекращается после полного и
надлежащего исполнения сторонами обязательств по Договору.<br>
7.2. Условия Договора могут быть изменены или дополнены по письменному соглашению сторон. <br>
<br><br>

8. ПРОЧИЕ УСЛОВИЯ<br>
8.1. При наступлении сроков погашения задолженности по Договору и недостаточности средств для погашения задолженности в полном объеме,
погашение задолженности перед Банком осуществляется в соответствии с законодательством Республики Беларусь.<br>
8.2. Споры сторон, возникающие в ходе выполнения условий Договора, разрешаются в суде Ленинского района г.Минска в порядке, предусмотренном
действующим законодательством Республики Беларусь.<br>
8.3. Во всём, что не урегулировано Договором, стороны руководствуются действующим законодательством Республики Беларусь.

<br><br>
9. ПЛАТЕЖИ КРЕДИТОПОЛУЧАТЕЛЯ<br>
9.1 Сумма ежемесячного платежа по погашению кредита на 3 месяца кредитополучателем перед Банком по Договору составляет ${requestScope.credit}&nbsp;руб. </p>
    </body>
</html>
